stubs/libxml2/samples/c0e1560d1966fab5cbecb2129612bf5db7625e17

<log:log xmlns:log="http://www.w3.org/2002/ws/addressing/logs/"><log:message testcase="test1100" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</wsa:Action></soap:Header><soap:Body><notify:notify xmlns:notify="http://example.org/notify">notify message</notify:notify></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1101" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">auid:6a6afa4d47996bc6</wsa:MessageID></soap:Header><soap:Body><notify:notify xmlns:notify="http://example.org/notify">notify message</notify:notify></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1102" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">auid:3a28f6887f1d7d9b</wsa:MessageID><wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address></wsa:ReplyTo></soap:Header><soap:Body><notify:notify xmlns:notify="http://example.org/notify">notify message</notify:notify></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1103" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">auid:ab7b05d2b0419e0b</wsa:MessageID><wsa:FaultTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address></wsa:FaultTo></soap:Header><soap:Body><notify:notify xmlns:notify="http://example.org/notify">notify message</notify:notify></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1104" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">auid:ddd76bafe02dd9dd</wsa:MessageID><wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address></wsa:ReplyTo><wsa:FaultTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address></wsa:FaultTo></soap:Header><soap:Body><notify:notify xmlns:notify="http://example.org/notify">notify message</notify:notify></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1106" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">auid:6cbdc2c0613ba93a</wsa:MessageID><wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address><wsa:ReferenceParameters><customer:CustomerKey xmlns:customer="http://example.org/customer">Key#123456789</customer:CustomerKey></wsa:ReferenceParameters></wsa:ReplyTo></soap:Header><soap:Body><notify:notify xmlns:notify="http://example.org/notify">notify message</notify:notify></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1107" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www-lk.wso2.com:5049/axis2/services/wsaTestService</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://exa